package com.epam.rd.java.basic.practice4;

import org.junit.Assert;
import org.junit.Test;

public class Part4Test {

    @Test
    public void shouldTestParseResultPart4() {
        String expected = "РљР»Р°СЃСЃ РґРѕР»Р¶РµРЅ СЂР°Р·Р±РёСЂР°С‚СЊ С‚РµРєСЃС‚РѕРІС‹Р№ С„Р°Р№Р» " +
                "Рё РІРѕР·РІСЂР°С‰Р°С‚СЊ РїСЂРµРґР»РѕР¶РµРЅРёСЏ РёР· С„Р°Р№Р»Р°.\n" +
                "РџРѕРґ РїСЂРµРґР»РѕР¶РµРЅРёРµРј РїРѕРЅРёРјР°С‚СЊ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚" +
                "СЊ, РєРѕС‚РѕСЂР°СЏ РЅР°С‡РёРЅР°РµС‚СЃСЏ СЃ Р±РѕР»СЊС€РѕР№ Р±СѓРєРІС‹ Рё Р·Р°РєР°РЅС‡РёРІР" +
                "°РµС‚СЃСЏ С‚РѕС‡РєРѕР№.\n" +
                "Р�СЃС…РѕРґРЅС‹Р№ С„Р°Р№Р» Р±СЂР°С‚СЊ РЅРµР±РѕР»СЊС€РёРј РїРѕ СЂР°Р·РјРµСЂСѓ.\n" +
                "Р”РѕСЃС‚Р°С‚РѕС‡РЅРѕ РЅРµСЃРєРѕР»СЊРєРѕ СЃС‚СЂРѕРє Рё РЅРµСЃРєРѕР»СЊРєРѕ РїСЂРµРґР»РѕР¶РµРЅРёР№.\n";

        Part4 part4 = new Part4();

        Assert.assertEquals(expected, part4.parseResult());
    }
}
